{
  "packageName": "Advanced Hue Hub Integration",
  "author": "Armand Welsh",
  "minimumHEVersion": "2.2.9",
  "licenseFile": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/LICENSE.md",
  "documentationLink": "https://github.com/apwelsh/hubitat/tree/master/hue",
  "communityLink": "https://community.hubitat.com/t/release-advanced-hue-bridge-integration/51420",
  "dateReleased": "2020-01-20",
  "apps": [
    {
      "id": "4ca23ce9-4e0f-4d0d-9fd2-9034376dc134",
      "name": "Advanced Hue Bridge Integration",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/app/hue-bridge-integration.groovy",
      "required": true,
      "oauth": false,
      "primary": true,
      "version": "1.6.8"
    }
  ],
  "drivers": [
    {
      "id": "1d0f66d0-afed-4fe6-a2c8-39619f5b8eaa",
      "name": "AdvancedHueBridge",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/device/advanced-hue-bridge.groovy",
      "required": true,
      "version": "1.5.0"
    },
    {
      "id": "11de790f-60db-48f4-bda3-72fa1d3c61b9",
      "name": "AdvancedHueGroup",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/device/advanced-hue-group.groovy",
      "required": true,
      "version": "1.6.1"
    },
    {
      "id": "4e877c99-7537-47d9-9849-9022e75fc355",
      "name": "AdvancedHueLightSensor",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/device/advanced-hue-light-sensor.groovy",
      "required": false,
      "version": "1.0.6"
    },
    {
      "id": "428ff30b-152a-4e21-8daf-fa58935a018a",
      "name": "AdvancedHueMotionSensor",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/device/advanced-hue-motion-sensor.groovy",
      "required": false,
      "version": "1.0.7"
    },
    {
      "id": "bbf68d11-1581-40a1-9218-561899546174",
      "name": "AdvancedHueTemperatureSensor",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/device/advanced-hue-temperature-sensor.groovy",
      "required": false,
      "version": "1.0.7"
    },
    {
      "id": "99bc549d-ffa2-4b97-bbb3-1b18fb576a37",
      "name": "AdvancedHueDimmerSensor",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/device/advanced-hue-dimmer-sensor.groovy",
      "required": false,
      "version": "1.0.3"
    },
    {
      "id": "0fdebe44-6a4b-48ca-859d-480252ac8ec4",
      "name": "AdvancedHueTapSensor",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/device/advanced-hue-tap-sensor.groovy",
      "required": false,
      "version": "1.0.3"
    },
    {
      "id": "c7ac5c30-d728-4370-8362-ee541a92ffc5",
      "name": "Advanced Hue RunLessWires Sensor",
      "namespace": "apwelsh",
      "location": "https://raw.githubusercontent.com/apwelsh/hubitat/master/hue/device/advanced-hue-runlesswires-sensor.groovy",
      "required": false,
      "version": "1.0.0"
    }
  ],
  "version": "1.10.24",
  "releaseNotes": "1.10.x revision:\n1.10.24 - Fix infinite :443 appending in host URL bug.\n1.10.23 - Possible fix for host address translation logic.  Possible fix for NPE when metadata is not fully updated.\n1.10.22 - added sensor capability to all non-button sendor types.\n1.10.19 - Fixed another bug in hub linking for new installs, and relinking processes.  Also added additional code to hue bridge driver to better pause the hub activity when hub is unlinked.\n1.10.18 - Add additional controls to try hub unlinking in attempt to silence hub activity while in an unlinked state.\n1.10.17 - Additional bug fixes to further improve relinking hubs.\n1.10.16 - Improved support for hub discovery, and fixed a bug in hub discovery code that prevented the app from finding the hub on the network.\n1.10.15 - Added support to auto-detect when IP Address of Hub changes, and update it.  This change is best implemented with a hub reboot however, it can be update pro-actively by unlinking and re-linking the hub.  This change was overlaid with a V2 API update, so that the app can now convert hue XY colors to a best match to HSV.  The change in color spaces is a bit wonky, due to proprietary mapping data not shared by Philips Hue, but it does currently get really close to the correct HSV values for Type C hue bulbs. \n1.10.14 - fix for lights turning off when level from Hue < 1\n1.10.13 - Simplified hub referesh and watchdog logic to improve stability.\n1.10.12 - Modified startLevelChange to turn on/off lights based on current level.\n1.10.11 - Added another enhancement to fix tracking of subscribed/unsubscribed state to further improve the watchdog timer behavior, and help the system keep the EventStream online.\n1.10.10 - Added a watchdog setting to force aggressive monitoring of dropped connections, and reworked the workflow that handles connecting/disconnecting processes to better handle the watchdog processing.\n1.10.9 - Fixed unlik hub to completely remove the hub linking details, and improved the ssdpSubscription handler\n1.10.8 - Fix ssdpDiscover scheduling causing event spamming in the events log.\n1.10.7 - fixed typo in last fix.\n1.10.6 - Fix to discovery of IP Address changes; now, unlink and relink will re-bind the hub if a new IP Address is assigned.\n1.10.5 - Fix bug from last change. \n1.10.4 - Added connection watchdog to hub device to attempt to auto-reconnect hub if disconnected.\n1.10.3 - fixed index out of bounds in log when full refresh runs.\n1.10.2 - Added support to set sensitivity on motion sensors and general support for maintaining device configs.\n1.10.1 - Fixed auto-refresh on groups. Added forced device refresh on detected light/group updates from hue event stream.  Still researching soltuion for slow to update states from Hue.\n1.10.0 - removed all hub refresh calls, and rely only on the event stream to update device states. It is required that you have an updated Hue bridge to work properly, as this version relies on the new v2 API for all device updates.  It is also recommended to turn on auto-refresh at the hub level only, with a very conservative refresh schedule, so as to not overload the HE hub with unnecessary hub processing.\n\n1.9.x revisions:\n1.9.8 - Skip color name computation if hub version is not version 2.3.2 or newer.\n1.9.7 - Fixed log spamming when eventStream messages do not have a Version 1 ID from Hue.\n1.9.6 - Fix type cast conversion error on line 1610.\n1.9.5 - Fix Null pointer when updating some groups lighting values.\n1.9.4 - Change minimum level reported to HE to 1, if hue device is on\n1.9.3 - Fixed scene bug to turn off active scene when group is turned off.\n1.9.2 - Fixed Hue Group handling of color / saturation changes not working on hue hub.  Added support for colorName reporting.  Removed redundant device info from group logging.\n1.9.1 - Fixed bug resulting in wrong temperatures reported on temp sensors.\n1.9.0 - Added RunLessWires Friends of Hue switch. (Thanks to @pocketgeek)\n1.8.x revisions:\n1.8.6 - Removed colormode state assignment, which has been removed from the Hue API, and no longer works.  With this change in Hue, some non-hue lighs will no longer work in groups correctly.  I do not have a fix for this Hue change.\n1.8.5 - Modified the main app to support devices w/o label defined.\n1.8.4 - Fixed errors reported in log when adding a new hue group.\n1.8.3 - Fix for default scene of group that prevents the group from turning on when scened default scene is defined.  This appears to be a change in Hue hub behavior, possibly related to v2 API updates. \n1.8.2 - Update dimmer and tap devices to allow pressing the same button multiple times, without losing the press event. \n1.8.1 - Correct the Hue Tap device name so the applicaiton can correctly associate the Tap button device to the device driver."
}